workflows/OneWayConnectingFlights_lock/AirPriceReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
					<soapenv:Header/>
					<soapenv:Body>
						<air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v42_0" AuthorizedBy="user" TargetBranch="P7090934" TraceId="trace">
							<com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v42_0" OriginApplication="UAPI"/>
								<air:AirItinerary><air:AirSegment Key="uG1M9B7Q2BKA2tnOCAAAAA==" Group="0" Carrier="PK" FlightNumber="308" Origin="KHI" Destination="ISB" DepartureTime="2020-04-16T16:00:00.000+05:00" ArrivalTime="2020-04-16T17:55:00.000+05:00" FlightTime="115" Distance="689" ETicketability="Yes" Equipment="320" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="uG1M9B7Q2BKA4tnOCAAAAA==" Group="0" Carrier="PK" FlightNumber="653" Origin="ISB" Destination="LHE" DepartureTime="2020-04-16T19:00:00.000+05:00" ArrivalTime="2020-04-16T20:00:00.000+05:00" FlightTime="60" Distance="167" ETicketability="Yes" Equipment="ATR" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/></air:AirItinerary><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="3" Code="ADT" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="1" Code="CNN" Age="11" DOB="2009-02-28" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="2" Code="INF" Age="1" DOB="2019-02-28" />
							<air:AirPricingCommand CabinClass="Economy"/>
						</air:AirPriceReq>
					</soapenv:Body>
				</soapenv:Envelope>